Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the perfection of wisdom?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། བདག་ཀྱང་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཆགས་པ་མེད་པར། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཡང་དམིགས་པ་མེད་པའི་ཚུལ་གྱིས་རྟོགས་པར་བྱེད་ཅིང་། སེམས་ཅན་རྣམས་ཀྱང་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཆགས་པ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྟོགས་པར་བྱ་བ་ལ། མི་དམིགས་པའི་ཚུལ་གྱིས་ཡང་དག་པར་སྐུལ་ཞིང་གཞོག་པ་དང་།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings who have cultivated the mind set on all-aspect omniscience themselves are without fixation with respect to all phenomena and discern the nature of all phenomena without apprehending anything, and then correctly induce, secure, and establish [other] beings toward nonfixation with respect to all phenomena and toward discernment of the nature of all phenomena, and they do so without apprehending anything, this is the perfection of wisdom possessed by bodhisattva great beings. “

source: རབ་ཏུ་འགོད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ། དེ་ནི་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་ནི། འདི་ལྟ་སྟེ། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་།
en: These, Subhūti, constitute the Great Vehicle of bodhisattva great beings. “

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དེ།
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings comprises [the eighteen aspects of emptiness], namely: (1) the emptiness of internal phenomena, (2) the emptiness of external phenomena, (3) the emptiness of both external and internal phenomena, (4) the emptiness of emptiness, (5) the emptiness of great extent, (6) the emptiness of ultimate reality, (7) the emptiness of conditioned phenomena, (8) the emptiness of unconditioned phenomena, (9) the emptiness of the unlimited, (10) the emptiness of that which has neither beginning nor end, (11) the emptiness of nonexclusion, (12) the emptiness of inherent existence, (13) the emptiness of all phenomena, (14) the emptiness of intrinsic defining characteristics, (15) the emptiness of nonapprehensibility, (16) the emptiness of nonentities, (17) the emptiness of essential nature, and (18) the emptiness of the essential nature of nonentities. “

source: དེ་ལ་ནང་སྟོང་པ་ཉིད་གང་ཞེ་ན། ནང་གི་ཆོས་ཞེས་བྱ་བ་ནི། མིག་དང་། རྣ་བ་དང་། སྣ་དང་།
en: If, among them, you ask what is (1) the emptiness of internal phenomena, the term internal phenomena comprises the eyes, ears, nose, tongue, body, and mental faculty.

source: ལྕེ་དང་། ལུས་དང་། ཡིད་དེ། དེ་ལ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར་ཏེ། མིག་མིག་གིས་སྟོང་ངོ་།
en: Among them, the eyes are empty of the eyes because they do not endure and they do not disintegrate.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་རོ། །མི་རྟག་མི་འཇིག་པའི་ཕྱིར།
en: If you ask why, it is because that is their very nature.

source: རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཡིད་ཀྱིས་སྟོང་ངོ་།
en: The ears, the nose, the tongue, the body, and the mental faculty are [respectively] empty of [the ears, the nose, the tongue, the body, and] the mental faculty, because they do not endure and they do not disintegrate.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because that is their very nature.

source: འདི་ནི་ནང་སྟོང་པ་ཉིད་དོ།
en: This is the emptiness of internal phenomena. “

source: །དེ་ལ་ཕྱི་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཕྱིའི་ཆོས་ཞེས་བྱ་བ་ནི། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་།
en: If you ask what is (2) the emptiness of external phenomena, the term external phenomena comprises sights, sounds, odors, tastes, tangibles, and mental phenomena.

source: རེག་དང་། ཆོས་རྣམས་ཏེ། དེ་ལ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར། གཟུགས་གཟུགས་ཀྱིས་སྟོང་ངོ་།
en: Among them, sights are empty of sights because they do not endure and they do not disintegrate.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་དེ་ཡིན་པའི་ཕྱིར་རོ།
en: If you ask why, it is because that is their very nature.

source: །དེ་བཞིན་དུ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཆོས་ཀྱིས་སྟོང་ངོ་།
en: Similarly, sounds, odors, tangibles, and mental phenomena are [respectively] empty of [sounds, odors, tangibles, and] mental phenomena because they do not endure and they do not disintegrate.

source: འདི་ནི་ཕྱི་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of external phenomena. “

source: །དེ་ལ་ཕྱི་ནང་སྟོང་པ་ཉིད་གང་ཞེ་ན། ནང་གི་སྐྱེ་མཆེད་དྲུག་དང་། ཕྱིའི་སྐྱེ་མཆེད་དྲུག་དང་། འདི་དག་ནི་ཕྱི་ནང་གི་ཆོས་ཞེས་བྱ་སྟེ།
en: If you ask what is (3) the emptiness of both external and internal phenomena, the term external and internal phenomena comprises the six inner sense fields and the six outer sense fields.

source: དེ་ལ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར། ནང་གི་ཆོས་རྣམས་ཕྱིའི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: Among them, inner phenomena are empty of outer phenomena because they do not endure and they do not disintegrate. {

source: །ཕྱིའི་ཆོས་རྣམས་ནང་གི་ཆོས་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: Outer phenomena are also empty of inner phenomena [because they do not endure and they do not disintegrate].

source: འདི་ནི་ཕྱི་ནང་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of external and internal phenomena. “

source: །དེ་ལ་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། མི་རྟག་མི་འཇིག་པའི་ཕྱིར། ཆོས་རྣམས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པའི་སྟོང་པ་ཉིད་དེས་སྟོང་པ་ཉིད་སྟོང་ངོ་།
en: If you ask what is (4) the emptiness of emptiness, the emptiness that is the emptiness of all phenomena is empty of emptiness because it does not endure and it does not disintegrate.

source: འདི་ནི་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of emptiness. “

source: །དེ་ལ་ཆེན་པོ་སྟོང་པ་ཉིད་གང་ཞེ་ན། མི་རྟག་མི་འཇིག་པའི་ཕྱིར། ཤར་ཕྱོགས་ཤར་ཕྱོགས་ཀྱིས་སྟོང་། ལྷོ་ཕྱོགས་ལྷོ་ཕྱོགས་ཀྱིས་སྟོང་། ནུབ་ཕྱོགས་ནུབ་ཕྱོགས་ཀྱིས་སྟོང་། བྱང་ཕྱོགས་བྱང་ཕྱོགས་ཀྱིས་སྟོང་། འོག་གི་ཕྱོགས་འོག་གི་ཕྱོགས་ཀྱིས་སྟོང་། སྟེང་གི་ཕྱོགས་སྟེང་གི་ཕྱོགས་ཀྱིས་སྟོང་། ཕྱོགས་མཚམས་རྣམས་ཕྱོགས་མཚམས་རྣམས་ཀྱིས་སྟོང་ངོ་།
en: If you ask what is (5) the emptiness of great extent, the eastern direction is empty of the eastern direction, the southern direction is empty of the southern direction, the western direction is empty of the western direction, the northern direction is empty of the northern direction, the nadir is empty of the nadir, the zenith is empty of the zenith, and the intermediate directions are empty of the intermediate directions because they do not endure and do not disintegrate.

source: འདི་ནི་ཆེན་པོ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of great extent. “

source: །དེ་ལ་དོན་དམ་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། དོན་དམ་པ་ནི་མྱ་ངན་ལས་འདས་པ་སྟེ།
en: If you ask what is (6) the emptiness of ultimate reality, the term ultimate reality denotes nirvāṇa.

source: མི་རྟག་མི་འཇིག་པའི་ཕྱིར། མྱ་ངན་ལས་འདས་པ་དེ་ཡང་མྱ་ངན་ལས་འདས་པས་སྟོང་ངོ་།
en: In this regard, nirvāṇa is empty of nirvāṇa because it does not endure and does not disintegrate.

source: འདི་ནི་དོན་དམ་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of ultimate reality. “

source: །དེ་ལ་འདུས་བྱས་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་བྱས་ཞེས་བྱ་བ་ནི་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་།
en: If you ask what is (7) the emptiness of conditioned phenomena, the term conditioned phenomena denotes the realm of desire, the realm of form, and the realm of formlessness.

source: གཟུགས་མེད་པའི་ཁམས་ཏེ། དེ་ལ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར། འདོད་པའི་ཁམས་འདོད་པའི་ཁམས་ཀྱིས་སྟོང་ངོ་། །གཟུགས་ཀྱི་ཁམས་གཟུགས་ཀྱི་ཁམས་ཀྱིས་སྟོང་ངོ་། །གཟུགས་མེད་པའི་ཁམས་གཟུགས་མེད་པའི་ཁམས་ཀྱིས་སྟོང་ངོ་།
en: Among them, the realm of desire is empty of the realm of desire, the realm of form is empty of the realm of form, and the realm of formlessness is empty of the realm of formlessness because they do not endure and do not disintegrate.

source: འདི་ནི་འདུས་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of conditioned phenomena. “

source: །དེ་ལ་འདུས་མ་བྱས་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་མ་བྱས་ཞེས་བྱ་བ་ནི་གང་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། གནས་པ་ལས་གཞན་དུ་འགྱུར་བ་མེད་པ་འདི་ནི་འདུས་མ་བྱས་ཞེས་བྱ་སྟེ། མི་རྟག་མི་འཇིག་པའི་ཕྱིར།
en: If you ask what is (8) the emptiness of unconditioned phenomena, the term unconditioned phenomena denotes anything that does not arise, that does not cease, and that does not change into something else.

source: འདུས་མ་བྱས་དེ་ནི་འདུས་མ་བྱས་ཀྱིས་སྟོང་ངོ་།
en: In this regard, unconditioned phenomena are empty of unconditioned phenomena because they do not endure and do not disintegrate.

source: འདི་ནི་འདུས་མ་བྱས་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of unconditioned phenomena. “

source: །དེ་ལ་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། གང་ལ་མཐའ་མི་དམིགས་པ་དེ་ནི་མཐའ་ལས་འདས་པ་སྟེ།
en: If you ask what is (9) the emptiness of the unlimited, the term unlimited denotes anything of which the limits are nonapprehensible.

source: མི་རྟག་མི་འཇིག་པའི་ཕྱིར། མཐའ་ལས་འདས་པ་མཐའ་ལས་འདས་པས་སྟོང་ངོ་།
en: The unlimited is empty of the unlimited because it does not endure and does not disintegrate.

source: འདི་ནི་མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of the unlimited. “

source: །དེ་ལ་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། གང་ལ་ཐོག་མ་མི་དམིགས་ཤིང་། ཐ་མ་ཡང་མི་དམིགས་པ་དེ་ལ་འགྲོ་བ་མི་དམིགས། འོང་བ་ཡང་མི་དམིགས་ཏེ།
en: If you ask what is (10) the emptiness of that which has neither beginning nor end, the going of anything is nonapprehensible and the coming of anything is nonapprehensible.

source: མི་རྟག་མི་འཇིག་པའི་ཕྱིར། ཐོག་མ་དང་ཐ་མ་མེད་པ་ཐོག་མ་དང་ཐ་མ་མེད་པས་སྟོང་ངོ་།
en: That which has neither beginning nor end is empty of that which has neither beginning nor end because it does not endure and does not disintegrate.

source: འདི་ནི་ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of that which has neither beginning nor end. {

source: །དེ་ལ་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན།
en: Dt.197} “If you ask what is (11) the emptiness of nonexclusion, there is no exclusion with respect to anything.

source: གང་ལ་གང་ཡང་དོར་བ་མེད་པ་སྟེ། མི་རྟག་མི་འཇིག་པའི་ཕྱིར། དོར་བ་མེད་པ་དོར་བ་མེད་པས་སྟོང་ངོ་།
en: Nonexclusion is empty of nonexclusion because it does not endure and does not disintegrate.

source: འདི་ནི་དོར་བ་མེད་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །དེ་ལ་རང་བཞིན་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདུས་བྱས་སམ། འདུས་མ་བྱས་ཀྱང་རུང་སྟེ།
en: This is called the emptiness of nonexclusion. “

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི། ཉན་ཐོས་རྣམས་ཀྱིས་མ་བྱས། རང་སངས་རྒྱས་རྣམས་ཀྱིས་མ་བྱས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་མ་བྱས། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་མ་བྱས་ཏེ།
en: If you ask what is (12) the emptiness of inherent existence, this term relates to the inherent existence of all phenomena, whether conditioned or unconditioned, which is not created by the śrāvakas, not created by the pratyekabuddhas, not created by bodhisattva great beings, and not created by the tathāgatas, arhats, completely awakened buddhas.

source: མི་རྟག་མི་འཇིག་པའི་ཕྱིར་རང་བཞིན་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Inherent existence is empty of inherent existence because it does not endure and does not disintegrate.

source: འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །དེ་ལ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་། མིག་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་དང་། གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་།
en: This is called the emptiness of inherent existence. “

source: ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་ཀྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། གཟུགས་ཡོད་པའི་ཆོས་དང་། གཟུགས་མེད་པའི་ཆོས་དང་།
en: If you ask what is (13) the emptiness of all phenomena, the term all phenomena denotes physical forms, feelings, perceptions, formative predispositions, consciousness, the eyes, the ears, the nose, the tongue, the body, the mental faculty, sights, sounds, odors, tastes, tangibles, mental phenomena, visual consciousness, auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, mental consciousness, sensory contact that is visually compounded, sensory contact that is audibly compounded, sensory contact that is nasally compounded, sensory contact that in lingually compounded, sensory contact that is corporally compounded, sensory contact that is mentally compounded, feelings conditioned by sensory contact that is visually compounded, feelings conditioned by sensory contact that is audibly compounded, feelings conditioned by sensory contact that is nasally compounded, feelings conditioned by sensory contact that is lingually compounded, feelings conditioned by sensory contact that is corporally compounded, feelings conditioned by sensory contact that is mentally compounded, corporeal phenomena, formless phenomena, conditioned phenomena, and unconditioned phenomena.

source: འདུས་བྱས་ཀྱི་ཆོས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་ཏེ། འདི་དག་ནི་ཆོས་ཐམས་ཅད་ཅེས་བྱའོ། །དེ་ལ་མི་རྟག་མི་འཇིག་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ངོ་།
en: In that regard, all phenomena are empty of all phenomena because they do not endure and do not disintegrate.

source: འདི་ནི་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of all phenomena. “

source: །དེ་ལ་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། གཟུགས་ནི་འཇིག་པའི་མཚན་ཉིད། ཚོར་བ་ནི་མྱོང་བའི་མཚན་ཉིད། འདུ་ཤེས་ནི་འཛིན་པའི་མཚན་ཉིད། འདུ་བྱེད་ནི་མངོན་པར་འདུ་བྱེད་པའི་མཚན་ཉིད།
en: If you ask what is (14) the emptiness of all intrinsic defining characteristics, this relates to the intrinsic defining characteristic of physical forms which is disintegration, the intrinsic defining characteristic of feelings which is emotional experience, the intrinsic defining characteristic of perceptions which is apprehending, the intrinsic defining characteristic of formative predispositions which is conditioning, and the intrinsic defining characteristic of consciousness which is representation.

source: རྣམ་པར་ཤེས་པ་ནི་རྣམ་པར་རིག་པའི་མཚན་ཉིད་དེ། མི་རྟག་མི་འཇིག་པའི་ཕྱིར། འདུས་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པའི་རང་རང་གི་མཚན་ཉིད་དེ་དག་གིས། ཆོས་དེ་དག་ཐམས་ཅད་སྟོང་ངོ་།
en: All such phenomena are empty of their respective intrinsic defining characteristics, which include the intrinsic defining characteristics of conditioned phenomena and the intrinsic defining characteristics of unconditioned phenomena, because they do not endure and do not disintegrate.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་དག་གི་རང་བཞིན་ནི་དེ་ཡིན་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because that is their very nature.

source: འདི་ནི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of intrinsic defining characteristics. “

source: །དེ་ལ་མི་དམིགས་པ་སྟོང་པ་ཉིད་གང་ཞེ་ན། གང་ལ་འདས་པ་མི་དམིགས་པ་དང་། མ་འོངས་པ་མི་དམིགས་པ་དང་། ད་ལྟར་བྱུང་བའི་གནས་མི་དམིགས་པ་སྟེ། མི་རྟག་མི་འཇིག་པའི་ཕྱིར།
en: If you ask what is (15) the emptiness of nonapprehensibility, it is the nonapprehensibility of anything that is past, the nonapprehensibility of anything that is present, and the nonapprehensibility of anything that is future.

source: མི་དམིགས་པ་མི་དམིགས་པས་སྟོང་ངོ་།
en: Nonapprehensibility is empty of nonapprehensibility because it does not endure and does not disintegrate.

source: འདི་ནི་མི་དམིགས་པ་སྟོང་པ་ཉིད་ཅེས་བྱའོ།
en: This is called the emptiness of nonapprehensibility. “

source: །དེ་ལ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཕྱིར། འདུས་པའི་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask what is (18) the emptiness of the essential nature of nonentities, it is the lack of essential nature in combinations [of conditioned phenomena] because all phenomena are dependently arisen.

source: མི་རྟག་མི་འཇིག་པའི་ཕྱིར། འདུས་པ་འདུས་པས་སྟོང་ངོ་།
en: Such combinations are empty of combinations because they do not endure and do not disintegrate.

source: འདི་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཅེས་བྱའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅུ་དྲུག་པ།
en: This is called the emptiness of the essential nature of nonentities. {

source: རབ་འབྱོར་གཞན་ཡང་དངོས་པོ་ནི་དངོས་པོས་སྟོང་ངོ་།
en: Dt.198} “Moreover, Subhūti, entities are empty of entities.

source: །དངོས་པོ་མེད་པ་ནི་དངོས་པོ་མེད་པས་སྟོང་ངོ་།
en: Nonentities are empty of nonentities.

source: །རང་བཞིན་ནི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Intrinsic entities are empty of intrinsic entities.

source: །གཞན་གྱི་དངོས་པོ་ནི་གཞན་གྱི་དངོས་པོས་སྟོང་ངོ་།
en: Extraneous entities are empty of extraneous entities. “

source: །དེ་ལ་དངོས་པོ་དངོས་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན། ཕུང་པོ་ལྔ་སྟེ།
en: If you ask in what way entities [are empty of] entities, the term entities denotes the five psycho-physical aggregates.

source: ཕུང་པོ་དེ་དག་ཀྱང་ཕུང་པོ་རྣམས་ཀྱིས་སྟོང་པས། དེ་ལྟར་ན་དངོས་པོ་དངོས་པོས་སྟོང་ངོ་།
en: Entities are empty of entities because the psycho-physical aggregates are empty of the psycho-physical aggregates. “

source: །ཇི་ལྟར་ན་དངོས་པོ་མེད་པ་དངོས་པོ་མེད་པས་སྟོང་ཞེ་ན། དངོས་པོ་མེད་པ་ཞེས་བྱ་བ་ནི། འདུས་མ་བྱས་སྟེ།
en: If you ask in what way (16) nonentities are empty of nonentities, the term nonentities denotes unconditioned phenomena.

source: འདུས་མ་བྱས་དེ་ཡང་འདུས་མ་བྱས་ཀྱིས་སྟོང་པས། དེ་ལྟར་ན་དངོས་པོ་མེད་པ་དངོས་པོ་མེད་པས་སྟོང་ངོ་།
en: Nonentities are empty of nonentities because unconditioned phenomena are empty of unconditioned phenomena. “

source: །ཇི་ལྟར་ན་རང་བཞིན་རང་བཞིན་གྱིས་སྟོང་ཞེ་ན། རང་བཞིན་ཞེས་བྱ་བ་ནི།
en: If you ask in what way (17) essential nature is empty of essential nature, the term essential nature denotes the unerring essential nature.

source: ངོ་བོ་ཉིད་མ་ནོར་བ་སྟེ། དེ་ལ་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཤེས་པས་མ་བྱས། མཐོང་བས་མ་བྱས་ཏེ།
en: Emptiness in this regard is that which is not created by being known and not created by being seen.

source: འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: This is the emptiness of essential nature. “

source: །དེ་ལ་གཞན་གྱི་དངོས་པོ་སྟོང་པ་ཉིད་གང་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་།
en: If you ask what is the emptiness of extraneous entities, whether the tathāgatas have appeared or whether the tathāgatas have not appeared, the abiding nature of all phenomena, reality, the realm of phenomena, maturity with respect to all phenomena, the real nature, the unmistaken real nature, the one and only real nature, and the very limit of reality—all such phenomena—are empty of extraneous entities.

source: དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་ནི་དེ་བཞིན་དུ་གནས་པ་སྟེ། དེ་ལྟར་ཆོས་དེ་དག་གཞན་གྱིས་སྟོང་པ་གང་ཡིན་པ་དེ་ནི་གཞན་གྱི་དངོས་པོ་སྟོང་པ་ཉིད་ཅེས་བྱ་སྟེ།
en: This is called the emptiness of extraneous entities. “

source: རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། འདི་ལྟ་སྟེ། དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: These, Subhūti, constitute the Great Vehicle of bodhisattva great beings. “
